# minimal report_checks лҚӨн”„ (-fields м—ҶмқҢ вҶ’ Delay/Time 2-col, prepare.py нҢҢм„ң кі„м•Ҫ).
# лӢӨмҲҳ max-pathлҘј лҚӨн”„н•ҳкі  endpointлі„ worstлҠ” prepare.pyк°Җ dedupн•ңлӢӨ (F3).
# мқёмһҗлҠ” envлЎң м „лӢ¬ (OpenROADлҠ” cmd_file л’Ө нҠёл Ҳмқјл§Ғ argv лҜём§Җмӣҗ).
# мӮ¬мҡ©: ODB=.. LIB=.. SDC=.. OUT=.. openroad -no_init -exit dump_report_checks.tcl
set odb $env(ODB)
set lib $env(LIB)
set sdc $env(SDC)
set out $env(OUT)

read_db $odb
read_liberty $lib
read_sdc $sdc

set fh [open $out w]
puts $fh [report_checks -path_delay max -format full_clock_expanded -group_path_count 10000]
close $fh
